using System;

namespace Chapter_026
{
    /// <summary>
    /// C#6.0和C#7.0新增内容学习
    /// 26.2 字符串插值（C#6.0）
    ///     主要在第三章中体现，插值符号 $"{变量名variable}",可以在cw或者String.Format中使用
    /// 26.3 自动属性初始化语句
    /// 26.4 自读自动属性
    /// 26.5 表达式函数体成员
    ///     代码必须由一个表达式组成，以分号结束。
    ///     不能有开始或结束大括号。
    ///     在参数列表和构成函数体的表达式之间使用Lambda运算符 =>
    ///     C#6.0中这个功能可以用在方法和属性的get访问器。C#7.0扩展到构造函数、终结函数、属性set访问器和索引器
    /// 26.6 using static
    /// 26.7 空条件运算符
    /// 26.8 在catch和finally块中使用await
    /// 26.9 nameof运算符
    /// 26.10 异常过滤器
    /// 26.11 索引初始化语句
    /// 26.12 集合初始化语句的扩展方法
    /// 26.13 改进的重载决策
    /// 26.14 值元组
    /// 26.15 is模式匹配
    /// 26.16 switch模式匹配
    /// 26.17 自定义析构函数
    /// 26.18二进制字面量和数字分隔符
    ///     int transparency = 0b11_11_11_11
    /// 26.19 out变量
    /// 26.20 局部函数
    /// 26.21 ref局部变量和ref返回
    /// 26.22 表达式函数体成员的扩展
    /// 26.23 throw表达式
    /// 26.24 扩展的async返回类型
    /// 
    /// </summary>
    public class NewAddContent
    {
        public static void Main(string[] args)
        {

        }
    }
}