/// <summary>
/// -------------------------------------------------------------------------------------------------------------------
/// Pascal大小写           CardDeck            用于类型名称和类中对外可见成员的名称。命名空间、类、方法、属性、公有字段
/// Camel大小写            totalCycleCount     用于局部变量的名称、方法声明的形参名称、类的实例
/// 下划线+Camel大小写     _cycleCount         用于私有和受保护的字段
/// -------------------------------------------------------------------------------------------------------------------
/// </summary>
namespace YY
{
    class YY
    {
        static void Main()
        {

        }
    }
}
